# ColorMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrideSettings..::..ColorMode Property
PointCloudOverrideSettings Class See Also
---
The current color mode for the PointCloudInstance element or its scan.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudColorMode ColorMode { get; set; }
```

Visual Basic
---
```text
Public Property ColorMode As PointCloudColorMode
	Get
	Set
```

Visual C++
---
```text
public:
property PointCloudColorMode ColorMode {
	PointCloudColorMode get ();
	void set (PointCloudColorMode value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace